{
  "_class_name": "WanSCAILModel",
  "_diffusers_version": "0.30.0",
  "dim": 5120,
  "eps": 1e-06,
  "ffn_dim": 13824,
  "freq_dim": 256,
  "in_dim": 20,
  "mask_dim": 28, 
  "model_type": "i2v",
  "num_heads": 40,
  "num_layers": 40,
  "out_dim": 16,
  "text_len": 512
}
